# С помощью цикла в цикле получаем num1 и num2
for num1 in range(1, 11):
    for num2 in range(1, 11):
        # умножаем num1*num2 и в результате получаем таблицу умножения
        print(f"{num1:2}  * {num2:2} = {num1*num2:2}", end="   ")
        # к переменным добавлено форматирование (:2), чтобы строки занимали минимум 2 символа в ширину
    print("\n ----------------------------------------------------------------------------", end="---")
    print("-------------------------------------------------------------------------------")