# Задание 1 - Необходимо создать класс

from rome import Roman

rome_1 = Roman(int_digit=4)

print(rome_1)

