INSERT INTO task_programmers (task_id, prog_id) VALUES
	('6c58f885-0634-48d1-85b2-07ae0a697225', 'e767ce0f-7a4a-47ba-ac85-ce87731a2e16'), -- Разработка пользовательского интерфейса
    ('4e5a37fd-40c2-463f-bc64-4f33975cfd5d', '33b131ea-dc22-4247-ba2d-8977fa707553'), -- Создание API для мобильного приложения
    ('80d9d6af-fc09-4188-b4ad-070216c1d0da', '71c36a41-1fee-4669-ae27-d2c25eaa5375'), -- Тестирование мобильного приложения
    ('3b418a74-9ba0-4063-ba5a-55fb6ce5e9ef', 'c90e4f95-66c9-45fb-8a8b-e665c2d068a3'), -- Анализ требований для системы аналитики
    ('cebee367-b9a5-411d-b6d5-33d3663eec22', 'b20e17b4-a18a-41e7-a4d5-16b98d24d0ff'), -- Разработка прототипа системы
    ('82e65822-b58e-4d3e-809d-8d5c7b6124f6', '1df74c01-15f0-4d0f-aed9-f515a33e478c'), -- Интеграция с существующими системами
    ('ef3ff255-54d6-4345-9780-b1768ee0e9fb', 'e73cea67-cb05-4400-96ac-9860cf085f31'), -- Сбор и анализ требований от Газпром
    ('0bb17f50-a3a7-417f-a8f1-63a1a6643c39', 'e767ce0f-7a4a-47ba-ac85-ce87731a2e16'), -- Проектирование базы данных
    ('42ac395f-676d-4037-aa13-45dbf80ee01d', '33b131ea-dc22-4247-ba2d-8977fa707553'), -- Разработка системы управления данными
    ('98e635c0-b891-492d-bd9e-5708ecb86242', '1df74c01-15f0-4d0f-aed9-f515a33e478c'), -- Исследование потребностей Правительства Ярославля
    ('ebfda965-07b9-454e-92ee-7a8bd5842dd8', 'b20e17b4-a18a-41e7-a4d5-16b98d24d0ff'), -- Создание архитектуры портала
    ('3ad9cca2-6ad7-4c7c-a0d0-2ae5db3db979', '71c36a41-1fee-4669-ae27-d2c25eaa5375'); -- Разработка и тестирование функционала

SELECT * FROM task_programmers;