INSERT INTO programmers (name, birthday, skill, telephone, salary) VALUES
	('Ширяев Игорь Владимирович','1978-05-17','Senior','8(980)492-26-07', 400000),
	('Зайцева Софья Львовна','1983.03.03','Middle','8(996)250-74-75', 200000),
	('Горбунов Артём Демидович','1998.02.19','Junior','8(921)540-10-00', 80000),
	('Николаев Мирон Андреевич','1974.01.02','Senior','8(888)918-80-67', 380000),
	('Одинцов Георгий Владимирович','1980.01.01','Middle','8(982)535-72-58', 210000),
	('Яковлев Александр Львович','1978.07.27','Middle','8(909)664-83-26', 200000),
	('Зотов Михаил Маркович','1997.05.19','Junior','8(906)758-18-60', 90000),
	('Горбунов Артём Демидович','1990.10.08','Junior','8(895)632-12-60', 85000)

ON CONFLICT (telephone) DO UPDATE
SET salary = EXCLUDED.salary;

SELECT * FROM programmers;