INSERT INTO tasks (project_id, description, start_task, end_task) VALUES
	('e2fda593-d453-41cc-b4ef-3287022e71aa', 'Разработка пользовательского интерфейса', '2025-03-16', '2025-04-10'),
    ('e2fda593-d453-41cc-b4ef-3287022e71aa', 'Создание API для мобильного приложения', '2025-04-11', '2025-05-05'),
    ('e2fda593-d453-41cc-b4ef-3287022e71aa', 'Тестирование мобильного приложения', '2025-05-06', '2025-06-01'),

    ('e53e38d9-a58c-49d3-b8d8-446fde115cdd', 'Анализ требований для системы аналитики', '2025-03-20', '2025-04-05'),
    ('e53e38d9-a58c-49d3-b8d8-446fde115cdd', 'Разработка прототипа системы', '2025-04-06', '2025-05-10'),
    ('e53e38d9-a58c-49d3-b8d8-446fde115cdd', 'Интеграция с существующими системами', '2025-05-11', '2025-06-15'),

    ('99ca39b5-55e6-421b-a13d-938b7f893e6a', 'Сбор и анализ требований от Газпром', '2025-02-01', '2025-02-20'),
    ('99ca39b5-55e6-421b-a13d-938b7f893e6a', 'Проектирование базы данных', '2025-02-21', '2025-03-10'),
    ('99ca39b5-55e6-421b-a13d-938b7f893e6a', 'Разработка системы управления данными', '2025-03-11', '2025-06-15'),

    ('01e525a6-da24-40f3-a535-482f33954ae2', 'Исследование потребностей Правительства Ярославля', '2025-03-15', '2025-04-01'),
    ('01e525a6-da24-40f3-a535-482f33954ae2', 'Создание архитектуры портала', '2025-04-02', '2025-05-01'),
    ('01e525a6-da24-40f3-a535-482f33954ae2', 'Разработка и тестирование функционала', '2025-05-02', '2025-09-01');


SELECT * FROM tasks;