INSERT INTO projects (title, client_id, project_manager_id, start_project, end_project) VALUES
	('Создание мобильного приложения', 'e52b33db-7472-4a72-93da-5a6642868982', 'e27d83ba-10d7-4f55-84a9-85e56a31266e', '2025-03-15', '2025-07-20'),
    ('Внедрение системы аналитики', 'e52b33db-7472-4a72-93da-5a6642868982', 'ca3df928-c129-4066-a7a6-da1ca235f2ef', '2025-04-05', '2025-08-15'),
	('Создание системы управления данными для Газпром', 'c6a15f29-333b-4979-bd6b-3c695195de99', 'aca0ec7e-eecf-45fc-8d7f-83693634c40c', '2025-02-01', '2025-07-15'),
    ('Разработка портала для Правительства Ярославля', '2b0a4e24-3786-4084-b4ff-2ed3ebc9f56a', '125e7cdd-d5ac-4d83-ab8f-65f6b7da186c', '2025-03-15', '2025-09-30');

SELECT * FROM projects;