# Задание
# Строительная компания нуждается в программе,
# которая бы по хотелкам клиента прикидывала
# смету и итоговую стоимость проекта.
#
# Существуют следующие классы:
# 1. Подвал
# - Тип фундамента
# - Подводимые коммуникации
# - Площадь
# - Мощность входной электрики
# 2. Этаж
# - Площадь
# - Кол-во комнат
# - Кол-во санузлов
# - Мощность входной электрики
# 3. Крыша
# - Наличие и площадь чердака
# - Тип крыши
# - Спутникая тарелка
# - Мощность входной электрики
# 4. Доп. постройки на территории
# - Площадь
# - Виды построек
# - Мощность входной электрики
# 5. Доп. опции
# - Виды опций
# Необходимо создать класс, который бы позволял
# по желанию клиента сконфигурировать объект
# Дом, внутри которого будут находится поля-объекты приведенных выше классов